node {
  name: "net_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 29
        }
        dim {
          size: 13
        }
      }
    }
  }
}
node {
  name: "net/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\r\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "net/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.2866910994052887
      }
    }
  }
}
node {
  name: "net/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2866910994052887
      }
    }
  }
}
node {
  name: "net/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "net/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 414407
    }
  }
}
node {
  name: "net/random_uniform/sub"
  op: "Sub"
  input: "net/random_uniform/max"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform/mul"
  op: "Mul"
  input: "net/random_uniform/RandomUniform"
  input: "net/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform"
  op: "Add"
  input: "net/random_uniform/mul"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/kernel/Assign"
  op: "Assign"
  input: "net/kernel"
  input: "net/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/kernel/read"
  op: "Identity"
  input: "net/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 20
          }
          dim {
            size: 60
          }
        }
        tensor_content: "\330.\006;\006\342\211>\207m\316\275(g)>\360\0105>\333A\025=*\350\241>+a\314=U\266\317=\316SB>\216\250{\276\320Q\253\274\356\322r=&\225)=?\003\363=,\372\\\272\006\004l=\346>,=1:\202<\003\235\315=\345\340\210=\004\266\263=\032\230\"\276\266\352\312\275\240Y\032\276\233\305\227<,d\203=\247\361*\275\327\241,\2762}\231={\375\036\276_\031/>\354\031\025=\340Y\222\275\334\317\036>\330\000X=\025\230q\276\2361\016\276u\200A>d\221\314\2748\274\203\273\243\211(>(|v=\251\206\201>\026\213\333<R\026\222\274Yp\345=\027\036\321=sq\032\275\006\"|\274\376a\177>(\001+\276\270Y8<\355\363\360\275\245U\002\275\3212J\276\302\305\224=m\205\272\274c\355\000\276/\222\332\275I,R\275\370-\341<7\024\002>\247\354\020\276\275\254\017>\364\301r\275\026 \000\276\327a\375<\246#\221\2731^\000\275\243\363%\275\232\303\354\273\250\321\223\273\035\306?>\262\206\341<\n\036a\276\370\362A\275\355\271\253\275\267\010B;\274\001\213\276 \021\225\275\325\3416\276Y.\207\275\"Q\004\276\020\374\235\275\210>\270:m\324b=\315g\310=\204\272R>\376\001\276\275\376\361\224=E\r\016=B\375i>1\020\327=A\255\030>!\326\350<\207\036m\276\315\035\334\274\260]%>\2426\002>\177\3643\276\242\376\325\276!+\301=\233\000<\275i\347\001>p\256j>\037U\211\275\260 \261=\257i\242=/\226\r\276\213|\247=\367G\315=\2264==\356\241\"\276\217\245\010>;\301\374\275\340\217\221\275y\255\247=\027W\024\276\252\357\n\275\316\373G\275\2156\024\276x\017\266\274\243\\j>rE/;Ox\207\2730G\266>\nR\274=\261 \337\274nvN>Y\202\274\275\252\237\027\276\n\246v>i\252\005>\322\212\275=PU\367\274\005mM<\247\361\027\276#\362\314=\261\366\002\275-\005Y=_\352*\275N\347\335=\013\016\325\275\010\330\037\276\302\3248\271\030x\271\275\205\010G\274\0276{=\326\371q\275\375\222\205=Z\264Y\276i`\237\274\306\276\233<\367\273\206\275\334\022N>h\007 >\r\004\007\275\021;\236<\360\005\002=c\361X<\274\357\"\2768\\\214<_\t\251\275\236\353\200\276\356\214\314\275\003\010\264<\020*\202\275\032\302\303\275\315\216\002>\270 \010\276_\010\220==\276_>\341\311\324=\005\230\210>\346 1>\231\270G\276\371C4\273\326u%\276\360\217*\276N`\261=2\032j<UK\205=\033\365\021=HR\324\275)\203\033>\201\337\224=\301\365\210\276cH$>^\226j<\014\351\002=\375<\010\275p\320\357\275\003lg=\246\002\036\276`P9\276q3\267<\001\327\002\276\214\013\274=\230\346\262>{\023\202>\360m\320\273\2030\204>\017\274\342=\356\351/\274L\367J<\262\245\323\275H\237\365<_\252K>q~\365\275\376r\033=;+\025>z\317\337=S\314\030\276\211\006&>\211\262W\276\027\330\177=\262\010l\274\345\363\010\275\307\025\361=\001\205\251\275\352y\317\274R\224\3038\005\264)>\032\370C>r\257\264\275RZ\203\274\016\302\326\275\244\336h\275\2677&>\300\025\375=\302\017S\275\246p\326=\252\344\000\2763\373m>\222\240/<\3359\321\275T\313\237<\236\021`\274\245\033P>\3639\227=C\224\316\275\034\0026>\240y~\276\236\020L\272y\312\212=\021\362x<a\213\010\275\334t:\276\006)\276<m\016\277<a\007\333\273n\336\033>\365\364Y\275\361\255\365<\252\352\021\276jP\270\276\276\227\246=\367\221\001>\234\372M>0\255v\276\310\377\224\274\311\275\250\275\225\354\273<.\270%\275\004\257\003>A\331\302=\006\2455\274\226Y\010=\367\365\273=\026\252\360\273H\246+>\340\242\006\276\225\334\317=\303\025\032=\203R\266=}\027j>\320\216;\276\327\004\213>\247\274J=Vv\331=\346\273\036>T\020\220=\314\211\235\274\241\340\035>\035\256.\275x\264j\275\250\254\\>\332\3542>\005x\256=\227\326\252\275?6&\276Q5\247=\224\222\356\275\037\310(>\270\265\'>\226]\224<\342\223\331;\036\314|=0\365\000\276OJ\230=?\\\362\275\311*D>\200\242\235\274\361\033\244<\343\240\206<\033`\340=\r\3535\275\200s\276\275\313$\370=\021!\007\275\334\243\263\275\023\265\312=\255a#>\250\264\344\274d\245\354=\247\203\340<\371n\351\275\214\301\r\276\036\347\025\276\\5\332\275\037.9>\210*A\276\272\331\310>U\355\236\275\350W\360=.b\\>9\246\245\275RF\350\2753w\350=\310j\034\275\036o\313=].%>\343-\004\275\255\220\240>\304\216L\274\2343\374=\r\206\025>\006;\210\276i\245\'=\340\377\003\275\203\007D=\013\031\234\275\251T\277=\031;:>\313\241\005\275i\325]\275\314>0\276\034\334C\275\210\241\361\275W-\265\274\\\377\201>p\373\n>b\214\'<\305\006\037<\325\274\276\272\213r\275;\354\231~=)\177\224=\271\240\026\276A\335(\275\276\231\326=<N\345\275\230b >\000\256\216\273\017~\214>\376v2\274\367#\334\275\351\207\000=\271\206&\275H\351\350\275\343$\232\274W\314\245=\222_2\275=\304\217\276\340\333P\275\341Y\260\275\330S1=\331\243\032>\222>\034\276\272\034|\275HSD\276\225\006z\276rl\276=\201\372\026>\250N\017>\021\027*=A\227\206\276\211\306\223=\234+\216\275Ibm=\264\316\237\275\017H\230\275\355\363\203=\177\200\202\276\374\331V>\305\2320\276\310A\022\2753\370\003={\032A\275\227S\032>{\003\004=z\372\333<aB\n>\203n\";\027\273\372\274Te\377\275\337\273X\276\226m\241\274Ss\363<\254zB=,L]>\347\252;>,\243p\276\003\024}=\374\376\251\273\030&\304=\206\2526\275*\314\t>\024\2648>\323iS>&x\362\275\2370\221\275\272H\262\275\214\337\331\275\320\003\022\276\371\302!>\031I_=l\347\266\274\277K\345<\003ip=\035\200&\275\241\365\376\275\332\204\354\275\220\217P\275\373@H\276;\326\205=T\004e>\362)\377\275\222\251\251<\320\3706:\221\243z\276<6\260=K\353\222=\266\352k\276`\3370=\367+9\275\305\260P<\251(Z>\023%\240=\301#\334\275\335\024\304\274\007\2471>?\321\'=s\035\241\2751\210\251=\027\216t\275~\320\374<3\030\210\275\304\365\231>\232h\257>\024f\217>%\213\327\275\214\213\'\275\t\314\t\276\203!\327=\331\342\332\275L?\366\275xe\327<\021\3318\276\026\000,>{\r4=\211<-\275\213\304M\274\r\223\014\275J\362\232\273\336\375\000=Y,\031>gT2\276\214uv\275\'\324a=\274\314\"\276})Y\275\363IL\2765\177`>\251$\205\275B\n\277\274\322*e<d\224\273>e\242\273<8\366\005\276\t\364\226>\031b\036\276\3004~=\365\357\210=\337\021\212=\r\3723\276\220\303E>,\354\276;)\033\374\275\031\252w\274\230\330\345\274zPE\275\032Bq>\360\236\364\275\272\237H\275!{N\276v.\333\275\026\225\300=\267\332\261;\362\227\215\275\324\311\324\275\213\360%\274k\010\231\275\r9\256\275\025]\312\275\247\376\353<\367{\001=\302\023\200>\304s\365\275iK\302\275\023\245\273=Z\335b<\t[\275\275\372\356L=\242\333\316\275\214$\220=\265\355\020\275=<\034\276\361\247d=t\277\037>\035V\341=\203\256\025>v;\020>\"\2413=\006\346,\275\027\215\204\276G\335^\275*=%>[\247\370\275\376\277\204\275\320X\224\275\364\214\270=\254\331$>+\032\001\276\247\352\023\276\372\003-<\177J\212=\031\256)\276\025\026*=\265~\032>\000vA=\031KB\276K\342\222\275\330\023\326\275\344q\363=OE\034>-{\233\275\2335Q\2754i\006=*\336Z>\0100\242<\024.S=\325F[=\243~n\275\353\037\366=\265\323;>\314Tk\275\032\2756>q)\321>\031\331`=\007\200\"=\207.\210\276\267\227\251\275\366\224\214=Ir\333\275P\007\031=\261s\216\275\261\302\271>\35044\276\311:\374=\216s&\276\314\262\003>s\277\343\275\375\227\254\275\031\203\r>\003c\023\275\304\215\307\275\031\371E\275\225I\262;ii\230=\177\017\342=\270\350\255=&\177\002\276\262\237\320<\013%!\276\304\345\236<\271i+\275\236>\217=\345\350\240\275\227\356l=\233o\020\276\317^:=\257\317-\275(7\344<\214UT\2749\300g\2759W\035>\212xA=c\010%\276 \270\206\276\326\365\030\276+\2001>\001;\333=8\327\220\274\323a\215=\245a\267=yTW\276\370y\332\275\247\235}>%\342\342\275\350Sj\276\377:j=\247\007\005\276Qsu=\031\253\366\274P\014\017>:\302\340:\270\004\003\275\345x\t\275\001\256\031\276s`\355=0z\035\276V\200\257=\243\357\t\275\001\311R\276\222\" \276\246\340\025>B\000\220=T\205\251=4\221\"\275\022\271<>\034\273\030\276\225\352h\276\200\275)\273\342\231\371=\276\307\241>z\264\351\275Y\020\371\273\370\022\256\275\302\202R=.\273\">~\240\201=\346\231\240\275\233\352\341=]\211\260=\215>\023\274\371\270\200\276\375\037\235=\277\340n=\276\005?\2765\345\200=P\000C>^\353?\276}\237\326=\244\022\\>xh\347=\247b\025>xg\230\275\0221\342<\354\324z\275p\004M>\272\304\\<\355\357\024=;\351\033\276\306\017z\275\312\367\257\274*\373n\276Pu*\275N\315N\275LXn\275\270\"\266;\307\312\217<\265I\000\276z\345N=LM\022\276\231\237v\275\031\310G\276\0050\001>\017N\035\276\020\215\305=Ts\216\274\242iG\276\177\272\315\272\236\373\360\273\"N\215\276\016\365\202=\203T\304=\264\000;\276\257K\031\276\323\272\237>\344\260}=U\311q\275m\363^\274\352{a:\342\356\202=\364\237\256\275\324\002\315<\331.4\276\220\205\r\276i\032\200=/}q\276Ex\320=\334\314\222=(\304\024=n\2208\276M\216W=m\340<>^\260\341\275M=\020\276\246\204\216\275z\3219\275\006&^\275\244o\037\274\212[\004\276\204\304\013>\256 \375;\307\017\256<f\312\356\275\353\005e=$\200\331\275\246P\027>9\020`\275\203oJ\275\355]\020>\342\305\003>\306\301\236=\266A\357<\023C\210=\026\351x\2762\0218>\263\222\276=C\322\312\275M\313\274\275\234\243\'>6\261n\275}\211\301=Y3&>\315\271Z>\260\310#\276\316\230><,\332!\276\226\235=\275\230\025\221=6\'z>\300\347{<\216\265L>\177\221\201\2768\245\341\275\204H.>yEY;\346%\232>N\227\316:Ig\324<V(\201\275\253*?>\202@\355=[H\201<\250\237H>V\306+\275\271\203\306=\002EJ\273\245\210\265=\222\224\014\276\332W\2259H\247\215\275\315g\230\2765w\017\276s\233\010>\263\354\266=\254\354\377\275\001\363\331\275\236\324\353\275\204HJ;\030\276\210\276\240\276=>\273\035\365\275\315\243u\275\014\247\215>\200S\243\274\242\t\274=\333\0007\276;\205$=\225$\342<\367c\254\275\273\216\033>\354\314B\2767\033\353\273\377\213V\275\334\375\036\276\027\316@=.\r{=\367D}=\201\r\267\275G\013\006=\365\323\033>\252>g\275\217eN\276\234/4=e\333\352=\334j\252\275\227J<>5\213\206=\025\031Z\276\246e-\275(/~=\317c+\275\213n\324<\335\367\343\275\343\007,>A7C>\"\023\002\276\341#A>\03229=D|\033=\375\024V>\237\215\261>_r)>E\265\200=\313N(\275o[^=la\322\275C\350\237=f\375\033>eLT\274}\255f=\352q\234\274\034\237\373\274q\354\357\273\327\210^\276@\315*\273\373\021Y<b\2013\276\237\345\337=\'\310,\275\362\226\006>\334v\246>\032\266\013\276\006\006\033>\204\346\274\2757\320\345=\035\220\341=\217\333\244\271cW\005\276\032\373a>\316V\213\276\351\223\004\276\233\355\335=\351\246\203\276h\315\300<\310\244\303\275\317\250\331=\006:\264\274\262\r\255=u\002/>C\004\207=\214r,=Yq\035>3_K<d\213\n=\310\2478=\234\205\226\275\234\033\212\276\023\331\033>\025\016\017>8\000\312\275\033\013.\276\226\321=>g\343\274<px)=\244\1775=F\332\311\275\006L\376< L4=Z=8=\350F9>\311Rh=\346T\013=\367\010t\276\316z\350\275\201\006|\276[N\036=Y\243\204\275!\370\370\275H\246$\273V\247\345=m\014\003\276G\007\316<\200\0051=\273\t\246\274\202oz>\"\204\215=\270Zo\276\363\236\274<4Ec\276\004\263\025>\370\261\236\273%\336\265\275m0\226\275\364R\244\275clU\276%\024U\275\346\005\266=\336\276\270=\331\346\021\276\320\230C=\2605\370\275N\"D>\331\014\036=x\007\001>\237+\207<)\357\226=x(\024\276\250j\243\274c\0058\273}\224\035=n\336\000\274\244\'6>\236\373K>\307V\214\274?\317\267\273\236\257\202=\317\213e\275\344\332\232> \267\311=\025\222\354\275.\0225>\302\036\\>k\014\373\274\350\316\005\2760\225\327\275l\223R\276\272\310*\273\272\360\357\275\370\213.\276\271u\321\275\330lS\275\333\313\263=Xw2=\202\206\330\272C\352}>\027\212\036=\032\177\t>\257\342\035>,\336-\276\350.\"\276w\022\317=\351&\377\274U\302\002\276~\345\360\275\361\264\024>\264\021.\275\327_\274\275\027F-=\200\016\226\275\204\310,>\022zT={L\234\275 \032\245\274\374vf>v!r>\023\341\201=j6\357\275K\231\026>\002\277\235<\215\003W>y\271\024>\376\377&\275S\301\325=\373\331\214=\324\033Z\275\301\201\275\275\235\246\254\275Et\377\275\037\304\224\276p\374\261\274\321\302`\276h\'l\274\303\351D\276\010 S\276\312ou>\370\277\333=25g=\241w\200=\013\327\231=F\023I\275]BE\275\232\177\000>^6R>3\024\346\273\026\016u=Y\333]\274}oy\275\366\327\311\274\350\312\001\274l<\024>\374\321\312\275\\+\034=\256\240\202=XJ\232\276j\264\222\275\2206\235\275G;#>\">\357\274\366n\350\275\301Y0>g\002\346<G\316\223\275\374~\222>+K\020=\225\247\014:\350\032$<\301\272\344=\0345\031\275\177\"*\276Q`F\276\024`\230=\360\260\343\275\264X\010>\272\272\263<\001\234\001<\277\277\243=v\0370=\232\353R=\362\263&\276\001\200\r\276\003\022\001\276\032\276|\275\323+->\3262\016>\374\003\016\274\213\236:>\004~\250\275k/=>\345\340\223<l\225\304\276\024d\256=\215\371\264\274\3533\027>\333m{\2740jx=\353]]\275\343x\177\275\323\361\004\2764\365T=6|^>\306\210\200\276\224\376N\276\206\301\340\275F\326S\275\304x\014\276\002\206\t\275\266s(\276l\231\004\276\025w\025\2767_2> 8\210\274#\373\263\275\027\3258:\032\264\000\276\361\366*=\257S\024\276\361M\302<\036\205\331\273\213\327\353\275\306\314\034>\265\023\033>]Rg\276\205\377J=l\nF\276\361\017/>\r\"X\273\357\206\220\276\202\t]\276/F\275\275\373\234\006>\3218\214\275N\367\177\275\366\272}\276\332i\033>\202\003\002>\t9\323\274\240\033\230\274R\354\275\275\230\277\366=\356\257^\275{{u=\234r\301\275\367V%=\231\344K\276\205K\324\275g\3527\276\005\016\326\273\010\367B\273\351\347\331\275i]\026\276\343\021\375<\351t\023\275\250T%>\203\256->r8\003>av\207>6\366\307\275I7\021\276\3411%=\"M\004=JrP\276\271\300O\275L\013(\276\371\336\373\275\256{L\276\373\203.>8\177y=\267\013(\274S\2404\275\217\343\"\276n\020\235=\240\254\354=\342\243\214\276\210\001{=\251\026\332\275\257\215[=D\031\376<\320\274\247=m\262\036>\272J\254\275o\266\214\274\014{\032\276\260/\335\275_[\214=\361\035\330\275Zt&>\224\317\206\275lT\271<\323\030\223\276TU\224\276\312m\272\274\326\372\t\276a_\303\274\245\265\232\275\246_\235<\314\023F;\360 ,<\321\217\230<Gr\212=\322~+\276,z\026\273\253\370\366\275\377\354\002>d\036\274\275x\223H\275\333\206\224\276\017\267\347=\342c\235=\333\340\014\275\360\334\312\275\027\003\243=\214\366\334\274\367\020&\276r\377g\275J\233\341\275\207Y$\274\244\010\362=\027\3013>\014\326 ;\234\224\263=\326wD>\02279>%\225\264=D\302\344\275l\377\260\272\232\252\331=\321\242\226\275\342\201\r>\353\214\265=\305\247<>\207\221\026>6:\034\275\2711\010\276{\241N>t\345\347\275\271\000\036\276\263u\204>O\231\300\274~\266\024\276h\320\205\276\030\337V\275;\311G=\237k\374=\001\331\352\275"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 20
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/recurrent_kernel/Assign"
  op: "Assign"
  input: "net/recurrent_kernel"
  input: "net/recurrent_kernel/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/recurrent_kernel/read"
  op: "Identity"
  input: "net/recurrent_kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
}
node {
  name: "net/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 60
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/bias/Assign"
  op: "Assign"
  input: "net/bias"
  input: "net/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/bias/read"
  op: "Identity"
  input: "net/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice/stack"
  input: "net/strided_slice/stack_1"
  input: "net/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_1/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_1/stack"
  input: "net/strided_slice_1/stack_1"
  input: "net/strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_2/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_2/stack"
  input: "net/strided_slice_2/stack_1"
  input: "net/strided_slice_2/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_3/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_3/stack"
  input: "net/strided_slice_3/stack_1"
  input: "net/strided_slice_3/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_4/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_4/stack"
  input: "net/strided_slice_4/stack_1"
  input: "net/strided_slice_4/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_5/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_5/stack"
  input: "net/strided_slice_5/stack_1"
  input: "net/strided_slice_5/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_6/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_6"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_6/stack"
  input: "net/strided_slice_6/stack_1"
  input: "net/strided_slice_6/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_7/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_7"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_7/stack"
  input: "net/strided_slice_7/stack_1"
  input: "net/strided_slice_7/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_8/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_8"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_8/stack"
  input: "net/strided_slice_8/stack_1"
  input: "net/strided_slice_8/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/zeros_like"
  op: "ZerosLike"
  input: "net_input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/Sum"
  op: "Sum"
  input: "net/zeros_like"
  input: "net/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "net/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/ExpandDims"
  op: "ExpandDims"
  input: "net/Sum"
  input: "net/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Tile/multiples"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/Tile"
  op: "Tile"
  input: "net/ExpandDims"
  input: "net/Tile/multiples"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/transpose/perm"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/transpose"
  op: "Transpose"
  input: "net_input"
  input: "net/transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Shape"
  op: "Shape"
  input: "net/transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_9/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9"
  op: "StridedSlice"
  input: "net/Shape"
  input: "net/strided_slice_9/stack"
  input: "net/strided_slice_9/stack_1"
  input: "net/strided_slice_9/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/strided_slice_10/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10"
  op: "StridedSlice"
  input: "net/transpose"
  input: "net/strided_slice_10/stack"
  input: "net/strided_slice_10/stack_1"
  input: "net/strided_slice_10/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/ones_like/Shape"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones_like/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/ones_like"
  op: "Fill"
  input: "net/ones_like/Shape"
  input: "net/ones_like/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/mul"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_1"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_2"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul"
  op: "MatMul"
  input: "net/mul"
  input: "net/strided_slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_1"
  op: "MatMul"
  input: "net/mul_1"
  input: "net/strided_slice_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_2"
  op: "MatMul"
  input: "net/mul_2"
  input: "net/strided_slice_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/BiasAdd"
  op: "BiasAdd"
  input: "net/MatMul"
  input: "net/strided_slice_6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_1"
  op: "BiasAdd"
  input: "net/MatMul_1"
  input: "net/strided_slice_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_2"
  op: "BiasAdd"
  input: "net/MatMul_2"
  input: "net/strided_slice_8"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/MatMul_3"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_4"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add"
  op: "Add"
  input: "net/BiasAdd"
  input: "net/MatMul_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_3/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.20000000298023224
      }
    }
  }
}
node {
  name: "net/mul_3"
  op: "Mul"
  input: "net/mul_3/x"
  input: "net/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_1"
  op: "Add"
  input: "net/mul_3"
  input: "net/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value"
  op: "ClipByValue"
  input: "net/add_1"
  input: "net/Const_1"
  input: "net/Const_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_2"
  op: "Add"
  input: "net/BiasAdd_1"
  input: "net/MatMul_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_4/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.20000000298023224
      }
    }
  }
}
node {
  name: "net/mul_4"
  op: "Mul"
  input: "net/mul_4/x"
  input: "net/add_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_3/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_3"
  op: "Add"
  input: "net/mul_4"
  input: "net/add_3/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_3"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_4"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value_1"
  op: "ClipByValue"
  input: "net/add_3"
  input: "net/Const_3"
  input: "net/Const_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_5"
  op: "Mul"
  input: "net/clip_by_value_1"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul_5"
  op: "MatMul"
  input: "net/mul_5"
  input: "net/strided_slice_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add_4"
  op: "Add"
  input: "net/BiasAdd_2"
  input: "net/MatMul_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_6"
  op: "Mul"
  input: "net/clip_by_value"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/sub/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/sub"
  op: "Sub"
  input: "net/sub/x"
  input: "net/clip_by_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_7"
  op: "Mul"
  input: "net/sub"
  input: "net/add_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_5"
  op: "Add"
  input: "net/mul_6"
  input: "net/mul_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/TensorArray"
  op: "TensorArrayV3"
  input: "net/strided_slice_9"
  attr {
    key: "clear_after_read"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "dynamic_size"
    value {
      b: false
    }
  }
  attr {
    key: "element_shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
  attr {
    key: "identical_element_shapes"
    value {
      b: true
    }
  }
  attr {
    key: "tensor_array_name"
    value {
      s: "output_ta"
    }
  }
}
node {
  name: "net/TensorArray_1"
